In [1]:
import pandas as pd

In [4]:
# datasets

#dataset
data={
    "Student":["Amit","Jhon","Kapil","Mukund","Sachin"],
    "Rank":[1,4,3,5,2],
    "Marks":[90,70,80,60,90]
     }
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4","Row5"])

In [5]:
df

     Student  Rank  Marks
Row1    Amit     1     90
Row2    Jhon     4     70
Row3   Kapil     3     80
Row4  Mukund     5     60
Row5  Sachin     2     90

In [9]:
print("Student Data ")
df.dtypes

Student Data

Student    object
Rank        int64
Marks       int64
dtype: object

In [10]:
#n dimension 
df.ndim

2

In [11]:
#size of the elements rows 5 and 3 columns 
df.size

15

In [12]:
#how to check the shapes (rows,columns)
df.shape

(5, 3)

In [14]:
#How to display index 
df.index

Index(['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], dtype='object')

In [15]:
# How to transpose the dataframe  rows,columns= columns ,rows
df.T

         Row1  Row2   Row3    Row4    Row5
Student  Amit  Jhon  Kapil  Mukund  Sachin
Rank        1     4      3       5       2
Marks      90    70     80      60      90

In [17]:
# how to find head with number or it will take first 5 rows
df.head()

     Student  Rank  Marks
Row1    Amit     1     90
Row2    Jhon     4     70
Row3   Kapil     3     80
Row4  Mukund     5     60
Row5  Sachin     2     90

In [18]:
df.head(3)

     Student  Rank  Marks
Row1    Amit     1     90
Row2    Jhon     4     70
Row3   Kapil     3     80

In [20]:
df1=df

In [21]:
df1.T

         Row1  Row2   Row3    Row4    Row5
Student  Amit  Jhon  Kapil  Mukund  Sachin
Rank        1     4      3       5       2
Marks      90    70     80      60      90

In [22]:
df1.tail

<bound method NDFrame.tail of      Student  Rank  Marks
Row1    Amit     1     90
Row2    Jhon     4     70
Row3   Kapil     3     80
Row4  Mukund     5     60
Row5  Sachin     2     90>

In [23]:
df.tail(2)

     Student  Rank  Marks
Row4  Mukund     5     60
Row5  Sachin     2     90